module test_threekingdoms_地名

using Test
using ThreeKingdoms.地名 # 州 郡 縣
using AbstractTrees # print_tree

상산군 = 郡("상산군", [縣("구문현"), 縣("난성현"), 縣("남행당현"), 縣("도향현"), 縣("방자현"), 縣("상애현"), 縣("영수현"), 縣("원씨현"), 縣("정형현"), 縣("진정현"), 縣("평극현"), 縣("포오현")])
# print_tree(상산군)

@test 縣("진정현") in 상산군.郡縣

낙양 = 郡("洛陽", [縣("낙양현"), 縣("하남현"), 縣("양현"), 縣("평음현"), 縣("곡성현"), 縣("구씨현"), 縣("공현"), 縣("성역현"), 縣("신성현"), 縣("언사현"), 縣("신정현"), 縣("평현"), 縣("육혼현")])

형양도위 = 郡("滎陽都尉", [縣("형양현"), 縣("권현"), 縣("원무현"), 縣("양무현"), 縣("중모현"), 縣("개봉현"), 縣("원릉현"), 縣("경현"), 縣("밀현")])

사례 = 州("司隸", [郡("하남윤", [낙양, 형양도위]), 郡("하내군"), 郡("하동군"), 郡("홍농군"), 郡("경조윤"), 郡("좌풍익"), 郡("우부풍")])

@test 地名.疆埸["司隸"].이름 == "사례"

end # module test_threekingdoms_地名
